swarm-wustl/esp-firmware/components/esp32/src/spi.cpp
#include "driver/spi_common.h"
#include "esp32.h"

#include "log.h"
#include <algorithm>
#include <memory>
#include <ranges>
#include <utility>
#include <vector>

namespace ESP32 {
constexpr int SPI_SCK = 18;
constexpr int SPI_MISO = 19;
constexpr int SPI_MOSI = 23;

inline constexpr size_t BYTES_TO_BITS(size_t bytes) { return bytes * 8; }

SPI::SPI(int cs) : cs_{cs}, owns_spi_line{true} {
  spi_bus_config_t config{
      .mosi_io_num = SPI_MOSI,
      .miso_io_num = SPI_MISO,
      .sclk_io_num = SPI_SCK,
      .quadwp_io_num = -1,
      .quadhd_io_num = -1,
      .data4_io_num = -1,
      .data5_io_num = -1,
      .data6_io_num = -1,
      .data7_io_num = -1,
      .max_transfer_sz = SOC_SPI_MAXIMUM_BUFFER_SIZE,
      .flags = SPICOMMON_BUSFLAG_MASTER, // TODO
      .isr_cpu_id = ESP_INTR_CPU_AFFINITY_AUTO, // TODO
      .intr_flags = 0,                          // TODO
  };

  spi_device_interface_config_t dev_config{
      // Command and address bits are for specific command and address phases of
      // SPI
      // These exist in more complex SPI devices, such as a flash device
      // For a simpler slave device like the DW1000, everything is handled in
      // the TX buffer
      // So, we can ignore these two phases
      .command_bits = 0,
      .address_bits = 0,

      .dummy_bits = 0,
      .mode = 0,
      .duty_cycle_pos = 0,
      .cs_ena_pretrans = 0,
      .cs_ena_posttrans = 0,
      .clock_speed_hz = SPI_MASTER_FREQ_20M,
      .input_delay_ns = 0,
      .spics_io_num = cs_,
      .flags = 0,
      .queue_size = 4, // TODO: queue size
      .pre_cb = NULL,
      .post_cb = NULL};

  // TODO: throw?
  // TODO: dynamically choose host/port?
  log("SPI init: %d", spi_bus_initialize(SPI2_HOST, &config, SPI_DMA_CH_AUTO));

  log("SPI add device: %d",
      spi_bus_add_device(SPI2_HOST, &dev_config, &dev_handle_));
}

SPI::~SPI() {
  // TODO: throw?
  if (dev_handle_) {
    log("SPI remove device: %d", spi_bus_remove_device(dev_handle_));
    dev_handle_ = nullptr;
  }

  if (owns_spi_line) {
    log("SPI deinit: %d", spi_bus_free(SPI2_HOST));
  }
}

SPI::SPI(SPI &&other)
    : cs_{std::exchange(other.cs_, -1)},
      owns_spi_line{std::exchange(other.owns_spi_line, false)},
      dev_handle_{std::exchange(other.dev_handle_, nullptr)} {}

SPI &SPI::operator=(SPI &&other) {
  if (this != &other) {
    SPI temp{std::move(other)};
    swap(temp);
  }

  return *this;
}

std::expected<void, esp_err_t> SPI::transfer_halfduplex(std::span<const std::byte> tx,
                                                        std::span<std::byte> rx) {
  // Use full-duplex since it allows large transfers via DMA channels (unlike
  // half) To simulate half-duplex transfers, we first do a tx transfer, then an
  // rx. This causes 2 transactions rather than 1, but makes large (e.g., 1024
  // bytes) reads/writes possible.
  size_t total = tx.size_bytes() + rx.size_bytes();

  std::vector<std::byte> tx_buf(total, std::byte{0});
  std::vector<std::byte> rx_buf(total, std::byte{0});

  // copy header into tx_buf, rest is zeros (dummy bytes)
  std::ranges::copy(tx, tx_buf.begin());

  spi_transaction_t transaction = {.length = BYTES_TO_BITS(total),
                                   .tx_buffer = tx_buf.data(),
                                   .rx_buffer = rx_buf.data()};

  esp_err_t res = spi_device_transmit(dev_handle_, &transaction);
  if (unlikely(res != ESP_OK))
    return std::unexpected(res);

  // response starts after the header bytes
  std::ranges::copy(rx_buf | std::views::drop(tx.size_bytes()), rx.begin());
  return {};
}

void SPI::swap(SPI &other) {
  std::swap(cs_, other.cs_);
  std::swap(owns_spi_line, other.owns_spi_line);
  std::swap(dev_handle_, other.dev_handle_);
}

} // namespace ESP32
